# 导入 os
# 用来读取文件信息
import os
from config import config

# =========================================================
# 1. 定义获取文件大小的函数
# =========================================================

def get_file_size_mb(
    path
):

    # 获取文件大小
    # 返回单位是 Byte
    size_bytes = os.path.getsize(
        path
    )

    # Byte 转换成 MB
    size_mb = (
        size_bytes
        /
        1024
        /
        1024
    )

    # 返回 MB
    return size_mb


# =========================================================
# 2. 获取 FP32 模型大小
# =========================================================

# 获取原始 FP32 模型文件大小
fp32_size = get_file_size_mb(
    str(config.fp32_model_dir / "model.safetensors")
)


# =========================================================
# 3. 获取 INT8 模型大小
# =========================================================

# 获取量化后的 INT8 文件大小
int8_size = get_file_size_mb(
    config.int8_state_path
)


# =========================================================
# 4. 计算压缩倍数
# =========================================================

# 原模型大小 ÷ 量化模型大小
compression_ratio = (
    fp32_size
    /
    int8_size
)


# =========================================================
# 5. 打印结果
# =========================================================

# 打印 FP32 模型大小
print(
    "FP32：",
    fp32_size,
    "MB"
)

# 打印 INT8 模型大小
print(
    "INT8：",
    int8_size,
    "MB"
)

# 打印压缩倍数
print(
    "压缩倍数：",
    compression_ratio
)